OpenFOAM-v1812/tutorials/multiphase/interCondensatingEvaporatingFoam/condensatingVessel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type        fixedValue;
        value       $internalField;
    }
    top
    {
        type        pressureInletOutletVelocity;
        value       uniform (0 0 0);
    }
    left
    {
        type        fixedValue;
        value       $internalField;
    }
    right
    {
        type        fixedValue;
        value       $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
